In [11]:
import openpyxl
import pandas as pd

In [17]:
caminho = (r'C:\Users\bernardo_b_garcia\Desktop\teste.xlsx')

In [18]:
df2 =pd.read_excel(caminho,engine ='openpyxl')

In [19]:
df2

    Nome   Idade          Cidade
0     Ana     28       São Paulo
1   Bruno     34  Rio de Janeiro
2  Carlos     45  Belo Horizonte
3   Diana     22        Curitiba

In [20]:
type(df2)

pandas.core.frame.DataFrame